//=============================================================================
// MenuChoice_ToggleCrouch
//=============================================================================

class MenuChoice_ToggleCrouch extends MenuChoice_EnabledDisabled;

// ----------------------------------------------------------------------
// LoadSetting()
// ----------------------------------------------------------------------

function LoadSetting()
{
	SetValue(int(!player.bToggleCrouch));
}

// ----------------------------------------------------------------------
// SaveSetting()
// ----------------------------------------------------------------------

function SaveSetting()
{
	player.bToggleCrouch = !bool(GetValue());
}

// ----------------------------------------------------------------------
// -------------------------------	---------------------------------------

function ResetToDefault()
{
	SetValue(int(!player.bToggleCrouch));
}

// ----------------------------------------------------------------------
// ----------------------------------------------------------------------

defaultproperties
{
helpText="Если активно, то клавиша приседания работает как переключатель."
actionText="|&Переключатель приседания"
}
