//=============================================================================
// MenuChoice_MaxLogLines
//=============================================================================

class MenuChoice_MaxLogLines extends MenuUIChoiceSlider;

// ----------------------------------------------------------------------
// LoadSetting()
// ----------------------------------------------------------------------

function LoadSetting()
{
	SetValue(player.GetMaxLogLines());
}

// ----------------------------------------------------------------------
// SaveSetting()
// ----------------------------------------------------------------------

function SaveSetting()
{
	player.SetMaxLogLines(GetValue());
}

// ----------------------------------------------------------------------
// ----------------------------------------------------------------------

function ResetToDefault()
{
	player.UpdateSensitivity(defaultValue);
}

// ----------------------------------------------------------------------
// SetEnumerators()
// ----------------------------------------------------------------------

function SetEnumerators()
{
	local int enumIndex;

	for(enumIndex=1;enumIndex<11;enumIndex++)
		SetEnumeration(enumIndex-1, enumIndex);
}

// ----------------------------------------------------------------------
// ----------------------------------------------------------------------

defaultproperties
{
     numTicks=10
     startValue=1.000000
     endValue=10.000000
     defaultValue=5.000000
helpText="Максимальное количество строчек диалога видимых на экране в любое время."
actionText="Макс. кол-во строк"
}
