//=============================================================================
// MenuChoice_ReverseStereo
//=============================================================================

class MenuChoice_ReverseStereo extends MenuChoice_OnOff;

// ----------------------------------------------------------------------
// LoadSetting()
// ----------------------------------------------------------------------

function LoadSetting()
{
	LoadSettingBool();
}

// ----------------------------------------------------------------------
// SaveSetting()
// ----------------------------------------------------------------------

function SaveSetting()
{
	SaveSettingBool();
}

// ----------------------------------------------------------------------
// ----------------------------------------------------------------------

defaultproperties
{
     defaultInfoWidth=83
helpText="Если включено, меняет местами левый и правый каналы."
actionText="|&Инверсное стерео"
     configSetting="ini:Engine.Engine.AudioDevice ReverseStereo"
}
